Autodesk.Revit.DB.Structure.RebarSplice.ConnectUnifiedRebarToChain(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Int32,System.Int32,System.Int32,System.Int32)
Establish a splice connection between input Rebars at the specified ends
Remarks:
The order of the input rebars is not important.
document:
The document that contains the two rebars that will be connected and the splice type.
unifiedId:
The element that is the result of unifying the bars
firstRebarId:
The id of the first Rebar in chain that will be unified.
secondRebarId:
The id of the second Rebar in chain that will be unified.
firstRebarEndInSplice:
The end of the first rebar that will be part of the connection with second rebar.
secondRebarEndInSplice:
The end of the second rebar that will be part of the connection with the first rebar.
unifiedEndAsFirst:
The end of the unified bar that corresponds to the end of the first rebar that is not involved in the splice connection with the second rebar.
unifiedEndAsSecond:
The end of the unified bar that corresponds to the end of the second rebar that is not involved in the splice connection with the first rebar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided id doesn't represent a valid Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
firstRebarEndInSplice must be 0 or 1.
-or-
secondRebarEndInSplice must be 0 or 1.
-or-
unifiedEndAsFirst must be 0 or 1.
-or-
unifiedEndAsSecond must be 0 or 1.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.ConnectSplicedRebarsToChain(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Int32,System.Int32,System.Int32,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSplicePosition)
Establish a splice connection between input Rebars at the specified ends
Remarks:
The order of the input rebars is not important.
document:
The document that contains the two rebars that will be connected and the splice type.
originalId:
The element that needs to be spliced
firstRebarId:
The id of the first Rebar in chain that will be connected.
secondRebarId:
The id of the second Rebar in chain that will be connected.
firstRebarEndInSplice:
The end of the first rebar that will be part of the connection with second rebar.
secondRebarEndInSplice:
The end of the second rebar that will be part of the connection with the first rebar.
originalEndAsFirst:
The end of the original bar that corresponds to the end of the first rebar that is not involved in the splice connection with the second rebar.
originalEndAsSecond:
The end of the original bar that corresponds to the end of the second rebar that is not involved in the splice connection with the first rebar.
spliceTypeId:
Identifies the splice type id that drives this splice connection.
splicePosition:
Identifies the splice position that drives this splice connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The spliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
-or-
The provided id doesn't represent a valid Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
firstRebarEndInSplice must be 0 or 1.
-or-
secondRebarEndInSplice must be 0 or 1.
-or-
originalEndAsFirst must be 0 or 1.
-or-
originalEndAsSecond must be 0 or 1.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.SplicePosition
Identifies the splice position.
Remarks:
This property describes the position of the splice face with respect to each bar end involved in splice.
Middle describes the behavior when both bar ends extends with half of the lap length and the splice plane sits between them.
End1 and End2 describes the behavior when one of the bar ends is on the splice plane and the other bar end extends with the lap length.
End1 means that the lap is computed towards the start of the splice chain, while End2 means that the lap is computed towards the end of the splice chain.
If the Rebar is not part of a splice chain, End1 will be computed towards to the end of the bar and End2 to the start of the bar.
For more information about the splice chain concept please check Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceChain(Rebar rebar).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025